<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;
use Illuminate\Support\Facades\Hash;
use Illuminate\Support\Str;

class SurveyQuestion extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::statement('SET FOREIGN_KEY_CHECKS=0;');
        DB::table('survey_questions')->truncate();
        DB::statement('SET FOREIGN_KEY_CHECKS=1;');
        DB::table('survey_questions')->insert([[
            'name' => 'يشجعني هذا المقرر علي مواصلة الدراسة'
        ],[
            'name' => 'تم توضيح أهداف المقرر محددة واضحة في منذ بداية الفصل الدراسي'
        ],[
            'name' => 'يتناسب محتوي المقرر مع فترة دراسته'
        ],[
            'name' => 'قام أستاذ المادة بشرح أهداف و محتوي المقرر عند بدء الدراسة'
        ],[
            'name' => 'قام أستاذ المادة بشرح نظام التقييم وتوزيع درجات المقرر عند بدء الدراسة '
        ],[
            'name' => 'يسمح أستاذ المادة بطرح الأسئلة والمناقشة بحرية داخل الفصل'
        ],[
            'name' => 'ألمس التشجيع على التعلم الذاتي من خلال الأبحاث وغيرها'
        ],[
            'name' => 'يجذب الأستاذ انتباه الطلبة أثناء المحاضرات'
        ],[
            'name' => 'قام أستاذ المادة بتغطية الموضوعات المحددة في محتوي المقرر'
        ],[
            'name' => 'يعلن أستاذ المادة عن مواعيد تواجده بمكتبه ويجيب على أسئلة الطلاب'
        ],[
            'name' => 'أستاذ المادة متمكن من مادته العلمية'
        ],[
            'name' => 'يتحدث أستاذ المادة بصوت مسموع وواضح'
        ],[
            'name' => 'أسلوب الشرح واضح و منظم'
        ],[
            'name' => 'يتواصل أستاذ المادة مع الطلاب بفاعلية خلال الدراسة عن بعد (On Line)'
        ],[
            'name' => 'يلتزم أستاذ المادة بالمواعيد الرسمية لبدء و انتهاء المحاضرات'
        ],[
            'name' => 'يربط أستاذ المادة بين موضوعات المقرر'
        ],[
            'name' => 'تتضمن المراجع جميع محتويات المقرر'
        ],[
            'name' => 'تتميز المراجع بسهولة العرض وسلاسة اللغة'
        ],[
            'name' => 'تتضمن المراجع تمارين وأمثلة متنوعة تساعد على الفهم'
        ],[
            'name' => 'طباعة المراجع واضحة'
        ],[
            'name' => 'تغطي الاختبارات مقدارا معقولا من محتوي المقرر'
        ],[
            'name' => 'أستفيد من مناقشة أوراق الاختبارات'
        ],[
            'name' => 'تعبر درجاتي عن مستوي أدائي'
        ],[
            'name' => 'يلتزم المعيد بالمواعيد المحددة للفصل'
        ],[
            'name' => 'يتواصل المعيد مع الطلاب بفاعلية خلال الدراسة عن بعد (On Line)'
        ],[
            'name' => 'يلتزم المعيد في السكاشن بالمادة العلمية للمقرر وتوجيهات أستاذ المقرر'
        ],[
            'name' => 'توفر الأكاديمية إمكانيات الدراسة وتراعى التباعد الاجتماعي'
        ],[
            'name' => 'توفر الأكاديمية قنوات لعرض تسجيلات المحاضرات والتجارب المعملية'
        ],[
            'name' => 'تسمح الأكاديمية بإجراء الامتحانات الشفهية عن بعد (On Line)'
        ],[
            'name' => 'تتيح الأكاديمية إمكانية تسليم ورفع ملفات التمارين والمشاريع علي قاعدة بيانات التعليم'
        ],[
            'name' => 'تراعى الأكاديمية الظروف المرضية للطلاب والمشتبه في مخالطتهم للمرضى فيما يتصل بنسب الحضور وإعادة عقد الامتحانات لهم'
        ],[
            'name' => 'أهم مقترحاتك لتعظيم الاستفادة من المقرر في حدود (3) نقاط:'
        ]]);
    }
}
